module.exports = {
	name: 'one-c-realization.orders.scenario',

	methods: {
		async process() {
			await this.broker.waitForServices([this.name, 'api'])

			// await this.broker.sendToChannel('extcode-topic', {
			// 	"eventrecid": Math.floor(Math.random() * 10000000000),
			// 	"exenttype": -1,
			// 	"systemtypestr": "Книгозаказ",
			// 	"reftypestr": "Договор продажи",
			// 	"codenum": 98765,
			// 	"exagreementnum": "",
			// 	"modifieddatetime": "2024-03-27T12:48:04.000Z",
			// 	"recid": 500400597,
			// 	"salesnumbersequence": "PSVK496626",
			// 	"reftype": 5,
			// 	"systemtype": 5
			// }, {key: "500400597"})
			//
			// await this.broker.sendToChannel('extcode-topic', {
			// 	"eventrecid": Math.floor(Math.random() * 10000000000),
			// 	"exenttype": -1,
			// 	"systemtypestr": "Книгозаказ",
			// 	"reftypestr": "Договор продажи",
			// 	"codenum": 56789,
			// 	"exagreementnum": "",
			// 	"modifieddatetime": "2024-03-27T12:48:04.000Z",
			// 	"recid": 5200100597,
			// 	"salesnumbersequence": "PSVK496626",
			// 	"reftype": 5,
			// 	"systemtype": 10
			// }, {key: "5200100597"})


			const messagesToApply = [
				// {
				// 	'table': 'one-c-act-provision-production-services',
				// 	'push_to_kafka': 1,
				// 	'action': 'insert',
				// 	'record': {
				// 		"recid": "abcde",
				// 		"_guid": "eee6580e-885f-11ee-b826-005056915c5b",
				// 		"_name": "Акт об оказании производственных услуг 00000001671 от 21.11.2023 14:20:11",
				// 		"_objtype": "DocumentObject.АктОбОказанииПроизводственныхУслуг",
				// 		"год": 2023,
				// 		"грузополучатель": {
				// 			"_objType": "CatalogRef.Контрагенты",
				// 			"_name": "",
				// 			"_guid": "00000000-0000-0000-0000-000000000000",
				// 			"IDAX": null,
				// 			"ИНН": null
				// 		},
				// 		"дата": "2023-11-21T14:20:11",
				// 		"датасоздания": "2023-11-22T10:41:03",
				// 		"договорконтрагента": {
				// 			"_objType": "CatalogRef.ДоговорыКонтрагентов",
				// 			"_name": "Лицензионный 1/3736",
				// 			"_guid": "bac36c32-4369-11ee-b81a-005056915c5b",
				// 			"IDAX": "PSVK496626",
				// 			"Номер": "Лицензионный 1/3736",
				// 			"Владелец": {
				// 				"_objType": "CatalogRef.Контрагенты",
				// 				"_name": "МБОУ ЛИБЕЖЕВСКАЯ СШ",
				// 				"_guid": "7799dfa0-60db-11e0-bb2a-001018890642",
				// 				"IDAX": "11136",
				// 				"ИНН": "5236003523"
				// 			}
				// 		},
				// 		"договорконтрагентаканал": {
				// 			"_objType": "CatalogRef.Каналы",
				// 			"_name": "Собств. Интернет-магазин",
				// 			"_guid": "4e7a8a17-d2e9-11e8-80fb-0050569c74c7",
				// 			"Наименование": "Собств. Интернет-магазин"
				// 		},
				// 		"договорконтрагентаканалкод": "000000006",
				// 		"источникзаказа": "Эксель",
				// 		"контрагент": {
				// 			"_objType": "CatalogRef.Контрагенты",
				// 			"_name": "МБОУ ЛИБЕЖЕВСКАЯ СШ",
				// 			"_guid": "7799dfa0-60db-11e0-bb2a-001018890642",
				// 			"IDAX": "14032",
				// 			"ИНН": "5236003523"
				// 		},
				// 		"контрагентidax": 11136,
				// 		"контрагентidax_original": "11136",
				// 		"номер": "00000001671",
				// 		"организация": {
				// 			"_objType": "CatalogRef.Организации",
				// 			"_name": "АО \"Издательство \"Просвещение\"",
				// 			"_guid": "e22b445a-c3b4-11d9-9771-00112f8e657b",
				// 			"ИНН": "7715995942"
				// 		},
				// 		"основнойтипноменклатуры": "Услуги",
				// 		"ответственный": {
				// 			"_objType": "CatalogRef.Пользователи",
				// 			"_name": "Андреева Вера Владимировна",
				// 			"_guid": "7034716f-579a-11ea-810f-0050569c74c7"
				// 		},
				// 		"пометкаудаления": false,
				// 		"проведен": true,
				// 		"реализацияэфу": true,
				// 		"сделка": {
				// 			"_objType": "DocumentRef.ЗаказПокупателя",
				// 			"_name": "Заказ покупателя 00000001406 от 25.08.2023 22:18:15",
				// 			"_guid": "913ad9d4-7bbe-11ee-b825-005056915c5b",
				// 			"Номер": "00000001406",
				// 			"Год": 2023
				// 		},
				// 		"статус": 25,
				// 		"суммавключаетндс": true,
				// 		"суммадокумента": 19547,
				// 		"счетфактурадата": "2023-11-21T14:20:11",
				// 		"счетфактураномер": "000000223541",
				// 		"услуги": [
				// 			{
				// 				"СуммаАвтоматическойСкидки": 0,
				// 				"ПроцентАвтоматическойСкидки": 0,
				// 				"ВидДеятельности": "",
				// 				"РегиональныйПроект": "",
				// 				"НомерСтроки": 1,
				// 				"Количество": 11,
				// 				"ЕдиницаИзмерения": "шт",
				// 				"Продукция": {
				// 					"_objType": "CatalogRef.Номенклатура",
				// 					"_name": "География. 10 класс. Базовый и углублённый уровни. Электронная форма учебника",
				// 					"_guid": "73aea46e-8841-11e9-8327-0050569c7d18",
				// 					"Наименование": "География. 10 класс. Базовый и углублённый уровни. Электронная форма учебника"
				// 				},
				// 				"СуммаБезНДС": 2970,
				// 				"СтавкаНДС": 10,
				// 				"СуммаНДС": 297,
				// 				"СуммаСНДС": 3267,
				// 				"КодSKU": "NM0088012",
				// 				"ХарактеристикаНоменклатуры": {
				// 					"_objType": "CatalogRef.ХарактеристикиНоменклатуры",
				// 					"_name": "2021",
				// 					"_guid": "73aea472-8841-11e9-8327-0050569c7d18",
				// 					"Наименование": "2021"
				// 				},
				// 				"ОсновнойТипНоменклатуры": "EFT, ЭФУ",
				// 				"ОсновнойТипНоменклатурыIDAX": "4",
				// 				"ЦенаБезНДС": 270,
				// 				"ЦенаСНДС": 297
				// 			},
				// 			{
				// 				"СуммаАвтоматическойСкидки": 0,
				// 				"ПроцентАвтоматическойСкидки": 0,
				// 				"ВидДеятельности": "",
				// 				"РегиональныйПроект": "",
				// 				"НомерСтроки": 2,
				// 				"Количество": 11,
				// 				"ЕдиницаИзмерения": "шт",
				// 				"Продукция": {
				// 					"_objType": "CatalogRef.Номенклатура",
				// 					"_name": "Литература. 10 класс. Базовый уровень. Электронная форма учебника. В 2 ч. Часть 1",
				// 					"_guid": "651994bc-18d9-11e9-987e-0050569c7d18",
				// 					"Наименование": "Литература. 10 класс. Базовый уровень. Электронная форма учебника. В 2 ч. Часть 1"
				// 				},
				// 				"СуммаБезНДС": 2970,
				// 				"СтавкаНДС": 10,
				// 				"СуммаНДС": 297,
				// 				"СуммаСНДС": 3267,
				// 				"КодSKU": "NM0083258",
				// 				"ХарактеристикаНоменклатуры": {
				// 					"_objType": "CatalogRef.ХарактеристикиНоменклатуры",
				// 					"_name": "2019",
				// 					"_guid": "e9acaa7b-aa32-11e9-8831-0050569c7d18",
				// 					"Наименование": "2019"
				// 				},
				// 				"ОсновнойТипНоменклатуры": "EFT, ЭФУ",
				// 				"ОсновнойТипНоменклатурыIDAX": "4",
				// 				"ЦенаБезНДС": 270,
				// 				"ЦенаСНДС": 297
				// 			}
				// 		],
				// 		"учитыватьндс": true,
				// 		"адресдоставки": "",
				// 		"бюджетный": true,
				// 		"видзаказа": "Бюджетный",
				// 		"датаотгрузки": "0001-01-01T00:00:00",
				// 		"датапоставкиподоговору": "2025-02-27T00:00:00",
				// 		"датафактическойдоставки": "0001-01-01T00:00:00",
				// 		"датацены": "0001-01-01T00:00:00",
				// 		"номердоговора": "Приложение № 9_к Дог. № 1/11 от 15.01.2025г.",
				// 		"описаниедоговора": "Приложение № __ к Дог. №__ от 2025г.",
				// 		"плановаядатаотгрузки": "2025-02-27T00:00:00",
				// 		"склад": "Томилино ГП",
				// 		"создалвисточнике": "Аверина Екатерина Викторовна",
				// 		"способдоставки": "Самовывоз",
				// 		"статуснаскладе": "Реализовано"
				// 	}
				// },
				{
					'table': 'one-c-act-provision-production-services',
					'push_to_kafka': 1,
					'action': 'insert',
					'record': {
						"recid": "abcd",
						"_guid": "b58926cf-f5a5-11ef-b810-0050560b23d8",
						"_name": "Реализация товаров и услуг ИПЦБ-003775 от 28.02.2025 0:01:00",
						"_objtype": "DocumentObject.АктОбОказанииПроизводственныхУслуг",
						"crocaxaptamodifieddate": "2025-06-10T17:22:35",
						"адресдоставки": "",
						"бюджетный": true,
						"виддокумента": "РеализацияТоваровУслуг",
						"видзаказа": "Бюджетный",
						"год": 2025,
						"грузоотправитель": {
							"_objType": "CatalogRef.Контрагенты",
							"_name": "",
							"_guid": "00000000-0000-0000-0000-000000000000",
							"IDAX": "",
							"ИНН": ""
						},
						"грузополучатель": {
							"_objType": "CatalogRef.Контрагенты",
							"_name": "",
							"_guid": "00000000-0000-0000-0000-000000000000",
							"IDAX": "",
							"ИНН": ""
						},
						"дата": "2025-02-28T00:01:00",
						"датаотгрузки": "2025-02-28T10:29:32",
						"датапоставкиподоговору": "0001-01-01T00:00:00",
						"датасоздания": "2025-02-28T10:29:24",
						"датафактическойдоставки": "0001-01-01T00:00:00",
						"датацены": "0001-01-01T00:00:00",
						"договорконтрагента": {
							"_objType": "CatalogRef.ДоговорыКонтрагентов",
							"_name": "Основной договор ИМ",
							"_guid": "4daecea2-7dbf-11ef-b80f-0050560b375e",
							"IDAX": "PSVK022199",
							"Номер": "бн",
							"Владелец": {
								"_objType": "CatalogRef.Контрагенты",
								"_name": "Розничный покупатель ИМ",
								"_guid": "e1277b46-63a6-11ef-b80e-0050560b375e",
								"ИНН": "",
								"IDAX": "69139"
							}
						},
						"договорконтрагентаканал": {
							"_objType": "CatalogRef.Каналы",
							"_name": "Собственный ИМ",
							"_guid": "b1c96c0c-d7ed-11ef-b80d-0050560b23f9",
							"Наименование": "Собственный ИМ"
						},
						"договорконтрагентаканалкод": "000000008",
						"источникзаказа": "Эксель",
						"контрагент": {
							"_objType": "CatalogRef.Контрагенты",
							"_name": "Розничный покупатель ИМ",
							"_guid": "e1277b46-63a6-11ef-b80e-0050560b375e",
							"IDAX": "69139",
							"ИНН": ""
						},
						"контрагентidax": 69139,
						"контрагентidax_original": "69139",
						"номер": "ИПЦБ-003775",
						"номердоговора": "бн",
						"описаниедоговора": "Основной договор ИМ",
						"организация": {
							"_objType": "CatalogRef.Организации",
							"_name": "АО \"Издательство \"Просвещение\"",
							"_guid": "e75a1a53-ca96-11ee-b80e-00505691daa6",
							"ИНН": "7715995942"
						},
						"основнойтипноменклатуры": "Товары",
						"ответственный": {
							"_objType": "CatalogRef.Пользователи",
							"_name": "Служебный пользователь",
							"_guid": "3636a745-b92e-11ef-b80c-0050560b23f9"
						},
						"плановаядатаотгрузки": "2025-02-27T00:00:00",
						"пометкаудаления": false,
						"проведен": true,
						"реализацияэфу": false,
						"сделка": {
							"_objType": "DocumentRef.ЗаказПокупателя",
							"_name": "Заказ клиента ИПЦБ-00038082 от 27.02.2025 16:46:59",
							"_guid": "57e7b9b8-f511-11ef-b810-0050560b23d8",
							"Номер": "ИПЦБ-00038082",
							"Год": 2025
						},
						"склад": "Интернет-магазин",
						"создалвисточнике": "Служебный пользователь",
						"способдоставки": "Самовывоз",
						"статус": 25,
						"статуснаскладе": "В пути",
						"суммавключаетндс": true,
						"суммадокумента": 631.55,
						"счетфактурадата": "2025-02-28T00:01:00",
						"счетфактураномер": "ИПЦБ-0004780",
						"услуги": [
							{
								"НомерСтроки": 1,
								"Количество": 1,
								"ЕдиницаИзмерения": "шт",
								"Продукция": {
									"_objType": "CatalogRef.Номенклатура",
									"_name": "Настольная игра \"Либрариум\"",
									"_guid": "2b98c165-a8b5-11ef-b809-0050560b23f9",
									"Наименование": "Настольная игра \"Либрариум\""
								},
								"СуммаБезНДС": 574.14,
								"СтавкаНДС": 10,
								"СуммаНДС": 57.41,
								"СуммаАвтоматическойСкидки": 0,
								"ПроцентАвтоматическойСкидки": 0,
								"ВидДеятельности": "",
								"РегиональныйПроект": "",
								"КодSKU": "NM0158243",
								"ХарактеристикаНоменклатуры": {
									"_objType": "CatalogRef.ХарактеристикиНоменклатуры",
									"_guid": "e94e6f5b-ca8c-11ef-b80c-0050560b23fc",
									"_name": "2024",
									"Наименование": "2024"
								},
								"ОсновнойТипНоменклатуры": "Печатное издание",
								"ОсновнойТипНоменклатурыIDAX": "1",
								"ЦенаБезНДС": 574.14,
								"ЦенаСНДС": 631.55
							}
						],
						"учитыватьндс": true
					}
				}
			]

			const messages = Buffer.from(JSON.stringify(messagesToApply)).toString('base64')

			await this.broker.call('api.apply', {
				body: {
					messages
				}
			})
		}
	},

	async started() {
		this.process()
	}
}
