module.exports = {
	name: 'one-c-incoming.orders.scenario',

	methods: {
		async process() {
			await this.broker.waitForServices([this.name, 'api', 'puller'])

			await this.broker.sendToChannel('extcode-topic', {
				"eventrecid": Math.floor(Math.random() * 10000000000),
				"exenttype": -1,
				"systemtypestr": "Книгозаказ",
				"reftypestr": "Договор продажи",
				"codenum": 54321,
				"exagreementnum": "",
				"modifieddatetime": "2024-03-27T12:48:04.000Z",
				"recid": 5200147597,
				"salesnumbersequence": "PSVK506272",
				"reftype": 5,
				"systemtype": 10
			}, {key: "5200147597"})

			await this.broker.sendToChannel('extcode-topic', {
				"eventrecid": Math.floor(Math.random() * 10000000000),
				"exenttype": -1,
				"systemtypestr": "Книгозаказ",
				"reftypestr": "Договор продажи",
				"codenum": 12345,
				"exagreementnum": "",
				"modifieddatetime": "2024-03-27T12:48:04.000Z",
				"recid": 563400597,
				"salesnumbersequence": "PSVK506272",
				"reftype": 5,
				"systemtype": 5
			}, {key: "563400597"})


			const messagesToApply = [
				{
					'table': 'one-c-customers-order', 'push_to_kafka': 1, 'action': 'insert', 'record': {
						'_objType': 'DocumentObject.ЗаказПокупателя',
						'_name': 'Заказ покупателя 00000108516 от 05.11.2023 12:33:59',
						'_guid': '913ad9d4-7bbe-11ee-b825-005056915c5b',
						'Номер': '00000108516',
						'Дата': '2023-11-05T12:33:59',
						'Проведен': true,
						'ПометкаУдаления': false,
						'Idax_Контрагента': '',
						'СуммаВключаетНДС': true,
						'СуммаДокумента': 21384,
						'УчитыватьНДС': true,
						'FiasRegion': '',
						'Год': 2023,
						'ДатаСозданияДокумента': '2023-11-05T12:34:53',
						'статус': 0,
						'Организация': {
							'_objType': 'CatalogRef.Организации',
							'_name': 'АО "Издательство "Просвещение"',
							'_guid': 'e22b445a-c3b4-11d9-9771-00112f8e657b',
							'ИНН': '7715995942'
						},
						'Грузополучатель': {
							'_objType': 'CatalogRef.Контрагенты',
							'_name': '',
							'_guid': '00000000-0000-0000-0000-000000000000',
							'IDAX': '58062',
							'ИНН': null
						},
						'Контрагент': {
							'_objType': 'CatalogRef.Контрагенты',
							'_name': 'СПБ ГБПОУ "МК ИМ. В.М.БЕХТЕРЕВА"',
							'_guid': 'd114e72e-233f-4d79-be34-6350695d8387',
							'IDAX': '58062',
							'ИНН': '7810260698'
						},
						'ДоговорКонтрагента': {
							'_objType': 'CatalogRef.ДоговорыКонтрагентов',
							'_name': 'Лицензионный 1/4947',
							'_guid': 'c5e04f32-7bba-11ee-b825-005056915c5b',
							'IDAX': 'PSVK506272',
							'Номер': 'Лицензионный 1/4947',
							'Владелец': {
								'_objType': 'CatalogRef.Контрагенты',
								'_name': 'СПБ ГБПОУ "МК ИМ. В.М.БЕХТЕРЕВА"',
								'_guid': 'd114e72e-233f-4d79-be34-6350695d8387',
								'IDAX': '239291',
								'ИНН': '7810260698'
							}
						},
						'ДоговорКонтрагентаКанал': {
							'_objType': 'CatalogRef.Каналы',
							'_name': 'Собств. Интернет-магазин',
							'_guid': '4e7a8a17-d2e9-11e8-80fb-0050569c74c7',
							'Наименование': 'Собств. Интернет-магазин'
						},
						'ДоговорКонтрагентаКаналКод': '000000001',
						'Ответственный': {
							'_objType': 'CatalogRef.Пользователи',
							'_name': 'Андреева Вера Владимировна',
							'_guid': '7034716f-579a-11ea-810f-0050569c74c7'
						},
						'Товары': [{
							'НомерСтроки': 1,
							'Номенклатура': {
								'_objType': 'CatalogRef.Номенклатура',
								'_name': 'Английский язык. 10 класс. Базовый уровень. Электронная форма учебника.',
								'_guid': 'bcda1ce6-3f4f-11e9-ba45-0050569c7d18',
								'Наименование': 'Английский язык. 10 класс. Базовый уровень. Электронная форма учебника.'
							},
							'Количество': 11,
							'ЕдиницаИзмерения': 'шт',
							'СуммаБезНДС': 2970,
							'СтавкаНДС': 10,
							'СуммаНДС': 297,
							'СуммаСНДС': 3267,
							'ХарактеристикаНоменклатуры': {
								'_objType': 'CatalogRef.ХарактеристикиНоменклатуры',
								'_name': 'ЛицензияЭФУна1год',
								'_guid': 'd0992bd0-5a97-11e9-b1a2-0050569c7d18',
								'Наименование': 'ЛицензияЭФУна1год'
							},
							'ЦенаБезНДС': 270,
							'ЦенаСНДС': 297,
							'КодSKU': 'NM0083284',
							'ОсновнойТипНоменклатуры': 'EFT, ЭФУ',
							'ОсновнойТипНоменклатурыIDAX': '4'
						}, {
							'НомерСтроки': 2,
							'Номенклатура': {
								'_objType': 'CatalogRef.Номенклатура',
								'_name': 'География. 10 класс. Базовый и углублённый уровни. Электронная форма учебника',
								'_guid': '73aea46e-8841-11e9-8327-0050569c7d18',
								'Наименование': 'География. 10 класс. Базовый и углублённый уровни. Электронная форма учебника'
							},
							'Количество': 25,
							'ЕдиницаИзмерения': 'шт',
							'СуммаБезНДС': 6750,
							'СтавкаНДС': 10,
							'СуммаНДС': 675,
							'СуммаСНДС': 7425,
							'ХарактеристикаНоменклатуры': {
								'_objType': 'CatalogRef.ХарактеристикиНоменклатуры',
								'_name': 'ЛицензияЭФУна1год',
								'_guid': '3993b2ac-aeae-11ed-b80a-00505691fc44',
								'Наименование': 'ЛицензияЭФУна1год'
							},
							'ЦенаБезНДС': 270,
							'ЦенаСНДС': 297,
							'КодSKU': '19-0562-03',
							'ОсновнойТипНоменклатуры': 'EFT, ЭФУ',
							'ОсновнойТипНоменклатурыIDAX': '4'
						}, {
							'НомерСтроки': 3,
							'Номенклатура': {
								'_objType': 'CatalogRef.Номенклатура',
								'_name': 'География.11 класс. Базовый и углубленный уровни. Электронная форма учебника',
								'_guid': '73aea48f-8841-11e9-8327-0050569c7d18',
								'Наименование': 'География.11 класс. Базовый и углубленный уровни. Электронная форма учебника'
							},
							'Количество': 25,
							'ЕдиницаИзмерения': 'шт',
							'СуммаБезНДС': 6750,
							'СтавкаНДС': 10,
							'СуммаНДС': 675,
							'СуммаСНДС': 7425,
							'ХарактеристикаНоменклатуры': {
								'_objType': 'CatalogRef.ХарактеристикиНоменклатуры',
								'_name': 'ЛицензияЭФУна1год',
								'_guid': '4a0a1ced-aeae-11ed-b80a-00505691fc44',
								'Наименование': 'ЛицензияЭФУна1год'
							},
							'ЦенаБезНДС': 270,
							'ЦенаСНДС': 297,
							'КодSKU': '19-0563-03',
							'ОсновнойТипНоменклатуры': 'EFT, ЭФУ',
							'ОсновнойТипНоменклатурыIDAX': '4'
						}, {
							'НомерСтроки': 4,
							'Номенклатура': {
								'_objType': 'CatalogRef.Номенклатура',
								'_name': 'Английский язык. 11 класс. Углублённый уровень. Электронная форма учебника.',
								'_guid': 'bcda1cf9-3f4f-11e9-ba45-0050569c7d18',
								'Наименование': 'Английский язык. 11 класс. Углублённый уровень. Электронная форма учебника.'
							},
							'Количество': 11,
							'ЕдиницаИзмерения': 'шт',
							'СуммаБезНДС': 2970,
							'СтавкаНДС': 10,
							'СуммаНДС': 297,
							'СуммаСНДС': 3267,
							'ХарактеристикаНоменклатуры': {
								'_objType': 'CatalogRef.ХарактеристикиНоменклатуры',
								'_name': 'ЛицензияЭФУна1год',
								'_guid': 'd69884d0-5a97-11e9-b1a2-0050569c7d18',
								'Наименование': 'ЛицензияЭФУна1год'
							},
							'ЦенаБезНДС': 270,
							'ЦенаСНДС': 297,
							'КодSKU': '24-2868-04',
							'ОсновнойТипНоменклатуры': 'EFT, ЭФУ',
							'ОсновнойТипНоменклатурыIDAX': '4'
						}],
						'Услуги': [],
						'recid': '913ad9d4-7bbe-11ee-b825-005056915c5b'
					}
				},
				{
					'table': 'one-c-customers-order', 'push_to_kafka': 1, 'action': 'insert', 'record': {
						'_objType': 'DocumentObject.ЗаказПокупателя',
						'_name': 'Заказ покупателя 00000108516 от 05.11.2023 12:33:59',
						'_guid': '913ad9d4-7bbe-11ee-b825-005056915c5b',
						'Номер': '00000108516',
						'Дата': '2023-11-05T12:33:59',
						'Проведен': true,
						'ПометкаУдаления': false,
						'Idax_Контрагента': '',
						'СуммаВключаетНДС': true,
						'СуммаДокумента': 21384,
						'УчитыватьНДС': true,
						'FiasRegion': '',
						'Год': 2023,
						'ДатаСозданияДокумента': '2023-11-05T12:34:53',
						'статус': 0,
						'Организация': {
							'_objType': 'CatalogRef.Организации',
							'_name': 'АО "Издательство "Просвещение"',
							'_guid': 'e22b445a-c3b4-11d9-9771-00112f8e657b',
							'ИНН': '7715995942'
						},
						'Грузополучатель': {
							'_objType': 'CatalogRef.Контрагенты',
							'_name': '',
							'_guid': '00000000-0000-0000-0000-000000000000',
							'IDAX': '14032',
							'ИНН': null
						},
						'Контрагент': {
							'_objType': 'CatalogRef.Контрагенты',
							'_name': 'СПБ ГБПОУ "МК ИМ. В.М.БЕХТЕРЕВА"',
							'_guid': 'd114e72e-233f-4d79-be34-6350695d8387',
							'IDAX': '14032',
							'ИНН': '7810260698'
						},
						'ДоговорКонтрагента': {
							'_objType': 'CatalogRef.ДоговорыКонтрагентов',
							'_name': 'Лицензионный 1/4947',
							'_guid': 'c5e04f32-7bba-11ee-b825-005056915c5b',
							'IDAX': 'PSVK506272',
							'Номер': 'Лицензионный 1/4947',
							'Владелец': {
								'_objType': 'CatalogRef.Контрагенты',
								'_name': 'СПБ ГБПОУ "МК ИМ. В.М.БЕХТЕРЕВА"',
								'_guid': 'd114e72e-233f-4d79-be34-6350695d8387',
								'IDAX': '239291',
								'ИНН': '7810260698'
							}
						},
						'ДоговорКонтрагентаКанал': {
							'_objType': 'CatalogRef.Каналы',
							'_name': 'Собств. Интернет-магазин',
							'_guid': '4e7a8a17-d2e9-11e8-80fb-0050569c74c7',
							'Наименование': 'Собств. Интернет-магазин'
						},
						'ДоговорКонтрагентаКаналКод': '000000006',
						'Ответственный': {
							'_objType': 'CatalogRef.Пользователи',
							'_name': 'Андреева Вера Владимировна',
							'_guid': '7034716f-579a-11ea-810f-0050569c74c7'
						},
						'Товары': [{
							'НомерСтроки': 1,
							'Номенклатура': {
								'_objType': 'CatalogRef.Номенклатура',
								'_name': 'Английский язык. 10 класс. Базовый уровень. Электронная форма учебника.',
								'_guid': 'bcda1ce6-3f4f-11e9-ba45-0050569c7d18',
								'Наименование': 'Английский язык. 10 класс. Базовый уровень. Электронная форма учебника.'
							},
							'Количество': 11,
							'ЕдиницаИзмерения': 'шт',
							'СуммаБезНДС': 2970,
							'СтавкаНДС': 10,
							'СуммаНДС': 297,
							'СуммаСНДС': 3267,
							'ХарактеристикаНоменклатуры': {
								'_objType': 'CatalogRef.ХарактеристикиНоменклатуры',
								'_name': 'ЛицензияЭФУна1год',
								'_guid': 'd0992bd0-5a97-11e9-b1a2-0050569c7d18',
								'Наименование': 'ЛицензияЭФУна1год'
							},
							'ЦенаБезНДС': 270,
							'ЦенаСНДС': 297,
							'КодSKU': 'NM0083284',
							'ОсновнойТипНоменклатуры': 'EFT, ЭФУ',
							'ОсновнойТипНоменклатурыIDAX': '4'
						}, {
							'НомерСтроки': 2,
							'Номенклатура': {
								'_objType': 'CatalogRef.Номенклатура',
								'_name': 'География. 10 класс. Базовый и углублённый уровни. Электронная форма учебника',
								'_guid': '73aea46e-8841-11e9-8327-0050569c7d18',
								'Наименование': 'География. 10 класс. Базовый и углублённый уровни. Электронная форма учебника'
							},
							'Количество': 25,
							'ЕдиницаИзмерения': 'шт',
							'СуммаБезНДС': 6750,
							'СтавкаНДС': 10,
							'СуммаНДС': 675,
							'СуммаСНДС': 7425,
							'ХарактеристикаНоменклатуры': {
								'_objType': 'CatalogRef.ХарактеристикиНоменклатуры',
								'_name': 'ЛицензияЭФУна1год',
								'_guid': '3993b2ac-aeae-11ed-b80a-00505691fc44',
								'Наименование': 'ЛицензияЭФУна1год'
							},
							'ЦенаБезНДС': 270,
							'ЦенаСНДС': 297,
							'КодSKU': '19-0562-03',
							'ОсновнойТипНоменклатуры': 'EFT, ЭФУ',
							'ОсновнойТипНоменклатурыIDAX': '4'
						}, {
							'НомерСтроки': 3,
							'Номенклатура': {
								'_objType': 'CatalogRef.Номенклатура',
								'_name': 'География.11 класс. Базовый и углубленный уровни. Электронная форма учебника',
								'_guid': '73aea48f-8841-11e9-8327-0050569c7d18',
								'Наименование': 'География.11 класс. Базовый и углубленный уровни. Электронная форма учебника'
							},
							'Количество': 25,
							'ЕдиницаИзмерения': 'шт',
							'СуммаБезНДС': 6750,
							'СтавкаНДС': 10,
							'СуммаНДС': 675,
							'СуммаСНДС': 7425,
							'ХарактеристикаНоменклатуры': {
								'_objType': 'CatalogRef.ХарактеристикиНоменклатуры',
								'_name': 'ЛицензияЭФУна1год',
								'_guid': '4a0a1ced-aeae-11ed-b80a-00505691fc44',
								'Наименование': 'ЛицензияЭФУна1год'
							},
							'ЦенаБезНДС': 270,
							'ЦенаСНДС': 297,
							'КодSKU': '19-0563-03',
							'ОсновнойТипНоменклатуры': 'EFT, ЭФУ',
							'ОсновнойТипНоменклатурыIDAX': '4'
						}, {
							'НомерСтроки': 4,
							'Номенклатура': {
								'_objType': 'CatalogRef.Номенклатура',
								'_name': 'Английский язык. 11 класс. Углублённый уровень. Электронная форма учебника.',
								'_guid': 'bcda1cf9-3f4f-11e9-ba45-0050569c7d18',
								'Наименование': 'Английский язык. 11 класс. Углублённый уровень. Электронная форма учебника.'
							},
							'Количество': 11,
							'ЕдиницаИзмерения': 'шт',
							'СуммаБезНДС': 2970,
							'СтавкаНДС': 10,
							'СуммаНДС': 297,
							'СуммаСНДС': 3267,
							'ХарактеристикаНоменклатуры': {
								'_objType': 'CatalogRef.ХарактеристикиНоменклатуры',
								'_name': 'ЛицензияЭФУна1год',
								'_guid': 'd69884d0-5a97-11e9-b1a2-0050569c7d18',
								'Наименование': 'ЛицензияЭФУна1год'
							},
							'ЦенаБезНДС': 270,
							'ЦенаСНДС': 297,
							'КодSKU': '24-2868-04',
							'ОсновнойТипНоменклатуры': 'EFT, ЭФУ',
							'ОсновнойТипНоменклатурыIDAX': '4'
						}],
						'Услуги': [],
						'recid': 'abcde'
					}
				}
			]

			const messages = Buffer.from(JSON.stringify(messagesToApply)).toString('base64')

			await this.broker.call('api.apply', {
				body: {
					messages
				}
			})
		}
	},

	async started() {
		this.process()
	}
}
